week5/planets-db/app/controllers/planets_controller.rb

  def create

    Planet.create(
      name: params[:name],
      image: params[:image],
      orbit: params[:orbit],
      diameter: params[:diameter],
      mass: params[:mass],
      temperature: params[:temperature],
      moons: params[:moons]
    )
---
INSERT INTO "planets" ("name", "image", "orbit", "diameter", "mass", "temperature", "moons", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @planet = Planet.find params[:id]  # id comes from the route "/planets/:id"
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def edit
    @planet = Planet.find params[:id]  # id comes from the route "/planets/:id/edit"
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    planet = Planet.find params[:id]
    planet.update(
      name: params[:name],
      image: params[:image],
      orbit: params[:orbit],
      diameter: params[:diameter],
      mass: params[:mass],
      temperature: params[:temperature],
      moons: params[:moons]
    )
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "planets" SET "name" = ?, "orbit" = ?, "diameter" = ?, "mass" = ?, "temperature" = ?, "moons" = ?, "updated_at" = ? WHERE "planets"."id" = ?  [["name", "Earth 2"], ["orbit", 2.0], ["diameter", 3.0], ["mass", 4.0], ["temperature", 5.0], ["moons", 6], ["updated_at", "2018-05-15 05:40:35.536118"], ["id", 1]]

  def destroy
    planet = Planet.find params[:id]
    planet.destroy
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 7]]