week5/bloggo/app/controllers/dogs_controller.rb

  def search
    # raise 'hell'
    terms = params[:query].split(' ')
    puts terms
    @results = Dog.where(" name LIKE ? OR bio LIKE ?", "%#{params[:query]}%", "%#{params[:query]}%")
---
SELECT "dogs".* FROM "dogs" WHERE (bio ILIKE '%decent%' AND bio ILIKE '%good%' AND bio ILIKE '%doggo%')

  def create
    @dog = Dog.new(dog_params)

    respond_to do |format|
      if @dog.save
---
INSERT INTO "dogs" ("name", "roundness", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Gary"], ["roundness", 3], ["bio", "Loves to run"], ["created_at", "2018-05-23 01:42:17.786733"], ["updated_at", "2018-05-23 01:42:17.786733"]]