week10/burning-airlines-rails-vue/ba-rails-backend/app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2  [["origin", "SYD"], ["destination", "JFK"]]
---
  def search

    puts "origin: #{params[:origin]}"
    puts "destination: #{params[:destination]}"

    results = Flight.where origin: params[:origin], destination: params[:destination]

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def show
    flight = Flight.find params[:id]