week7/ajax-dashboard/app/controllers/dashboard_controller.rb

  def dogs
    render json: Dog.all   # render an ActiveRecord query result directly to JSON
---
SELECT "dogs".* FROM "dogs"