week5/tunr-wdi27/app/controllers/mixtapes_controller.rb

  def create
    # mixtape = Mixtape.create mixtape_params
    mixtape = Mixtape.new mixtape_params
    mixtape.user = @current_user   # mixtape.user_id = @current_user.id
    mixtape.save
---
INSERT INTO "mixtapes" ("title", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "graaaaaaant"], ["image", ""], ["created_at", "2018-05-18 04:21:18.054827"], ["updated_at", "2018-05-18 04:21:18.054827"], ["user_id", 6]]

  def index
    @mixtapes = Mixtape.all
---
SELECT "mixtapes".* FROM "mixtapes"

  def update
    @mixtape.update mixtape_params
---
UPDATE "mixtapes" SET "title" = $1, "image" = $2, "updated_at" = $3 WHERE "mixtapes"."id" = $4  [["title", "Jogging Hits BY GRANT"], ["image", "http://fillmurray.com/400/500"], ["updated_at", "2018-05-18 02:34:57.921197"], ["id", 18]]

  def destroy
    # thanks to before_action, two things are done before this method is called:
    # get_mixtape (which sets @mixtape)
    # check_is_owner (which makes sure @current_user.id == @mixtape.user_id)
    @mixtape.destroy
---
DELETE FROM "mixtapes" WHERE "mixtapes"."id" = $1  [["id", 14]]

  def get_mixtape
    @mixtape = Mixtape.find params[:id]
---
SELECT  "mixtapes".* FROM "mixtapes" WHERE "mixtapes"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]