week5/tunr-wdi27/app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "textchimp@gmail.com"], ["LIMIT", 1]]
---
  def create

    # look up the user by the given email address
    user = User.find_by email: params[:email]