week5/tunr-wdi27/app/controllers/users_controller.rb

  def create
    user = User.create user_params
---
INSERT INTO "users" ("email", "username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @user = User.find params[:id]  # i.e. /users/17
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]