week10/fruitstore-tdd/app/controllers/fruits_controller.rb

  def index
    @fruits = Fruit.all.reverse
---
SELECT "fruits".* FROM "fruits"

  def create
    fruit = Fruit.create fruit_params
---
INSERT INTO "fruits" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2018-06-21 00:48:40.097720"], ["updated_at", "2018-06-21 00:48:40.097720"], ["name", "Strawberry"]]