week5/moma-app/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "nationality", "dob", "period", "image", "roundness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    artist = Artist.create artist_params

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def show
    @artist = Artist.find params[:id]   # /artists/:id

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def edit
    @artist = Artist.find params[:id]  # /artists/:id/edit

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "Pablo Picasso2"], ["updated_at", "2018-05-16 05:19:10.635383"], ["id", 17]]
---
  def update
    artist = Artist.find params[:id]

    # check the result of the update directly (returns false on errors)
    if artist.update artist_params

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 17]]
---
  def destroy
    Artist.destroy params[:id]   # artist = Artist.find params[:id];  artist.destroy