week5/moma-app/app/controllers/works_controller.rb

  def create
    Work.create work_params  # use strong params to prevent form haxx00rs
---
INSERT INTO "works" ("title", "year", "medium", "style", "image", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @work = Work.find params[:id]   # /works/:id
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def edit
    @work = Work.find params[:id]   # /works/:id/edit
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def update
    work = Work.find params[:id]   # PATCH /works/:id
    work.update work_params
---
SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "works" SET "title" = ?, "year" = ?, "style" = ?, "medium" = ?, "updated_at" = ? WHERE "works"."id" = ?  [["title", "Test2"], ["year", "19992"], ["style", "fun2"], ["medium", "dirt2"], ["updated_at", "2018-05-16 06:20:52.736022"], ["id", 11]]

  def destroy
    Work.destroy params[:id]
---
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 12]]