week5/tunr-wdi27/app/views/mixtapes/show.html.erb


<% if @current_user.present? && @mixtape.user == @current_user %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]