week5/moma-app/app/views/works/_form.html.erb

   <%= f.label :artist_id, 'Artist' %>
   <%= f.select :artist_id, Artist.pluck(:name, :id), include_blank: true %>
---
SELECT "artists"."name", "artists"."id" FROM "artists"

      <option value="">Please select:</option>
      <%= Artist.all.each do |a| %>
---
SELECT "artists".* FROM "artists"